app/views/movies/index.html.erb

      <th class= '<%= @movie_class %>'>
        <%= link_to 'Movie Title', movies_path(:home => "1",:sorted => 'title', :ratings => Hash[@ratings_to_show.collect { |item| [item, "1"] } ]), id: "title_header"%>
---
SELECT "movies".* FROM "movies"