app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
    def index
      puts params[:home]
      if params[:home] == "1"
        puts "BALLS"
        session[:ratings] = params[:ratings]
        session[:sorted] = params[:sorted]
      end
      @all_ratings = Movie.all_ratings
      @movie_class = 'hilite'
      @release_date_class = 'hilite'
      if not session[:ratings].nil?
        @ratings_to_show = session[:ratings].keys
        @movies = Movie.with_ratings(@ratings_to_show)
      else
        @ratings_to_show = Movie.all_ratings
        @movies = Movie.all